/*----------------------------------------------------------------
// Copyright (C) 2010 有限公司
// 版权所有。 
//
// 文件名：         ControlMode.cs
// 文件功能描述：   输入控件模式
//
// 
// 创建标识：
//
// 修改标识：
// 修改描述：
//
// 修改标识：
// 修改描述：
----------------------------------------------------------------*/

namespace MES.Common
{
    /// <summary>
    ///     输入控件模式
    /// </summary>
    public enum ControlMode
    {
        /// <summary>
        ///     查询
        /// </summary>
        Query,

        /// <summary>
        ///     编辑
        /// </summary>
        Edit
    }
}