/*----------------------------------------------------------------
// Copyright (C) 2010 有限公司
// 版权所有。 
//
// 文件名：         IInitControl.cs
// 文件功能描述：   初始化控件
//
// 
// 创建标识：
//
// 修改标识：
// 修改描述：
//
// 修改标识：
// 修改描述：
----------------------------------------------------------------*/


namespace MES.Common
{
    /// <summary>
    /// 初始化控件
    /// </summary>
    public interface IInitControl
    {
        /// <summary>
        /// 初始化
        /// </summary>
        void Init();
    }
}